k-d-7/Midterm-MCU/STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_RED_Pin GPIO_PIN_5
#define LED_RED_GPIO_Port GPIOA
#define SEG7_a_Pin GPIO_PIN_6
#define SEG7_a_GPIO_Port GPIOA
#define SEG7_b_Pin GPIO_PIN_7
#define SEG7_b_GPIO_Port GPIOA
#define SEG7_c_Pin GPIO_PIN_8
#define SEG7_c_GPIO_Port GPIOA
#define SEG7_d_Pin GPIO_PIN_9
#define SEG7_d_GPIO_Port GPIOA
#define SEG7_e_Pin GPIO_PIN_10
#define SEG7_e_GPIO_Port GPIOA
#define SEG7_f_Pin GPIO_PIN_11
#define SEG7_f_GPIO_Port GPIOA
#define SEG7_g_Pin GPIO_PIN_12
#define SEG7_g_GPIO_Port GPIOA
#define RESET_Pin GPIO_PIN_13
#define RESET_GPIO_Port GPIOA
#define INC_Pin GPIO_PIN_14
#define INC_GPIO_Port GPIOA
#define DEC_Pin GPIO_PIN_15
#define DEC_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
